In [3]:
import pandas as pd

In [4]:
fp = r"/home/parallels/Downloads/FL_insurance_sample.csv"
data = pd.read_csv(fp)

In [5]:
# print(data.head)
print(data.shape)

(36634, 18)

In [7]:
data.head(1)

,policyID,statecode,county,eq_site_limit,hu_site_limit,fl_site_limit,fr_site_limit,tiv_2011,tiv_2012,eq_site_deductible,hu_site_deductible,fl_site_deductible,fr_site_deductible,point_latitude,point_longitude,line,construction,point_granularity
0,119736,FL,CLAY COUNTY,498960.0,498960.0,498960.0,498960.0,498960.0,792148.9,0.0,9979.2,0.0,0,30.102261,-81.711777,Residential,Masonry,1

In [8]:
data1 = {
     'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
     'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai',
              'Manchester', 'Cairo', 'Osaka'],
     'age': [41, 28, 33, 34, 38, 31, 37],
     'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
}

row_labels = [101, 102, 103, 104, 105, 106, 107]

In [12]:
real_python = pd.DataFrame(data=data1, index=row_labels)

In [13]:
real_python

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [36]:
import numpy as np
arr = np.array([[1, 2, 100, 4, 5, 8, 65],
               [2, 4, 100, 5, 2, 33, 4],                         
               [3, 8, 100, 9, 9, 9, 4]])

In [37]:
import pandas as pd

df = pd.DataFrame(arr, columns=['a', 'b', 'c', 'd', 'x', 'y', 'z'], index=[x+1000 for x in range(3)])

In [22]:
l = [x+100 for x in range(5)]
l

[100, 101, 102, 103, 104]

In [38]:
df

      a  b    c  d  x   y   z
1000  1  2  100  4  5   8  65
1001  2  4  100  5  2  33   4
1002  3  8  100  9  9   9   4

When importing a numpy array, copy is set to False. This means that any change to the array will update in the DataFrame.

In [8]:
arr[0, 1] = 1000
arr[0, 0] = 1000

In [9]:
df

        x     y    z
100  1000  1000  100
101     2     4  100
102     3     8  100

In [7]:
df.at[100, 'z']

100

In [9]:
df.iat[2, 2]

100

In [39]:
df.loc[2:, 'z'] = 9000

In [45]:
df

      a  b    c  d  x   y     z
1000  1  2  100  4  5   8  9000
1001  2  4  100  5  2  33  9000
1002  3  8  100  9  9   9  9000

In [51]:
new = pd.Series(data=[9,8,7,6,5,4,3], index=df.columns, name=1004)

In [52]:
df = df.append(new)

In [53]:
df

      a  b    c  d  x   y     z
1000  1  2  100  4  5   8  9000
1001  2  4  100  5  2  33  9000
1002  3  8  100  9  9   9  9000
4     9  8    7  6  5   4     3
1004  9  8    7  6  5   4     3

In [54]:
df = df.drop(labels=[4])
df

      a  b    c  d  x   y     z
1000  1  2  100  4  5   8  9000
1001  2  4  100  5  2  33  9000
1002  3  8  100  9  9   9  9000
1004  9  8    7  6  5   4     3

map() function applies to every row in a column.

In [55]:
df.a = df.a.map(lambda x: x*2)
df

       a  b    c  d  x   y     z
1000   2  2  100  4  5   8  9000
1001   4  4  100  5  2  33  9000
1002   6  8  100  9  9   9  9000
1004  18  8    7  6  5   4     3

In [56]:
df.b = df.b.map(lambda x: x-1)
df

       a  b    c  d  x   y     z
1000   2  1  100  4  5   8  9000
1001   4  3  100  5  2  33  9000
1002   6  7  100  9  9   9  9000
1004  18  7    7  6  5   4     3

In [57]:
df = df.apply(lambda x: x/2)
df

        a    b     c    d    x     y       z
1000  1.0  0.5  50.0  2.0  2.5   4.0  4500.0
1001  2.0  1.5  50.0  2.5  1.0  16.5  4500.0
1002  3.0  3.5  50.0  4.5  4.5   4.5  4500.0
1004  9.0  3.5   3.5  3.0  2.5   2.0     1.5

In [58]:
df.columns

Index(['a', 'b', 'c', 'd', 'x', 'y', 'z'], dtype='object')

In [60]:
l = list(df.b.unique())
l

[0.5, 1.5, 3.5]

In [63]:
df = df.sort_values(by='y', ascending=True)
df

        a    b     c    d    x     y       z
1004  9.0  3.5   3.5  3.0  2.5   2.0     1.5
1000  1.0  0.5  50.0  2.0  2.5   4.0  4500.0
1002  3.0  3.5  50.0  4.5  4.5   4.5  4500.0
1001  2.0  1.5  50.0  2.5  1.0  16.5  4500.0

In [64]:
fp = './array.csv'
df.to_csv(fp)